In [1]:
#Programmer: Sai Sudhir Mozar
#College: Keystone School Of Engineering ,Pune
#Class:TE-B
#RollNo: 03

In [2]:
#Pandas: structured data analysis
import pandas as pd

#Numpy : array operation
import numpy as np

ARRAY

In [3]:
#Array present in numpy

num=np.array([1,2,3,4,5])
num

array([1, 2, 3, 4, 5])

In [4]:
type(num)

numpy.ndarray

In [5]:
num.dtype

dtype('int32')

In [6]:
num[3]  #accessing index elem 3

4

SERIES

In [7]:
#Series is a class inside pandas lib
#Series and Arrays are equivalent to each other

s=pd.Series([29,28,56,89,45])
s

0    29
1    28
2    56
3    89
4    45
dtype: int64

In [8]:
type(s)  #s is obj

pandas.core.series.Series

In [9]:
s.dtype

dtype('int64')

In [10]:
s.size

5

In [11]:
s.shape #1D 5 elems

(5,)

In [12]:
s.describe

<bound method NDFrame.describe of 0    29
1    28
2    56
3    89
4    45
dtype: int64>

In [13]:
#Index in Seires can be changed by 'range' given
s=pd.Series([29,28,56,89,45],index=range(100,105))
s

100    29
101    28
102    56
103    89
104    45
dtype: int64

In [14]:
#Accessing Series elem by index 
s[103]

89

DATAFRAME

In [15]:
#Data frame: 2D where every col is of diff type
#(only data structure which have tabular structure)
#'data in every col is series' and that too of heterogenous type(same)

In [17]:
#Creating Dataframe of 3 cols
r=pd.Series([1,2,3,4,5])
n=pd.Series(['Sai','Ranav','Pranita','Shanaya','James'])
marks=pd.Series([11,12,13,14,15])
df=pd.DataFrame({'Rollno':r,'Names':n,'Marks':marks})
df

   Rollno    Names  Marks
0       1      Sai     11
1       2    Ranav     12
2       3  Pranita     13
3       4  Shanaya     14
4       5    James     15

In [18]:
df.shape

(5, 3)

In [19]:

df.size

15

In [20]:
df.dtypes
#object datatype=string

Rollno     int64
Names     object
Marks      int64
dtype: object

In [21]:

type(df)

pandas.core.frame.DataFrame

In [22]:
#structured data analysis is prefered in .csv i.e coma sep val file, excel,min space max info (notepad)

In [23]:
#To fetch the curr path/dir of file
import os
os.getcwd()

'C:\\Users\\saimo\\Downloads\\dataset'

In [24]:
#Accessing Dataframes
df1=pd.read_csv('student.csv') #read the csv file
df1 #display the csv file

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [25]:
df2=pd.read_csv('student1.csv')
df2
#prob no  col name specified in header 
#to fix this we do following

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [26]:
cols=['A','B','C','D','E'] # manually assigning col names
df2=pd.read_csv('student1.csv',names=cols)
df2

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [27]:
df3=pd.read_csv('student3.tsv') #tsv : tab seperated value file
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [28]:
df3=pd.read_csv('student3.tsv',sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [29]:
#reading link file 
df4=pd.read_csv("https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv")
df4

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [30]:
#excel files are heavy file
df5=pd.read_excel('student.xlsx')
df5

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [31]:
#using df object attributes

In [32]:
df1.shape

(10, 5)

In [33]:
df1.size

50

In [34]:
df1.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [35]:
df1.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [36]:
df1.ndim #dimensions

2

In [37]:
df1.index

RangeIndex(start=0, stop=10, step=1)

In [38]:
df1.T
#T=transpose: rows interchanged with columns

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [39]:
#Functions and Methods

In [40]:
df1.head()#by default head count is 5
df1.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [41]:
df1.tail() # display last 5 rows
df1.tail(2)

   roll   name class  marks  age
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21